In [1]:
import pandas as pd

In [41]:
data = pd.read_csv(r"D:\New folder\category.csv")
df_category=pd.DataFrame(data)

In [51]:
df_category.head()

  category_id category_name
0       CAT-1        Laptop
1       CAT-2         Audio
2       CAT-3        Tablet
3       CAT-4    Smartphone
4       CAT-5      Wearable

In [5]:
df_category.isna().sum()

category_id      0
category_name    0
dtype: int64

In [7]:
df_category.duplicated().sum()

0

In [63]:
data = pd.read_csv(r"D:\New folder\products.csv")
df_products=pd.DataFrame(data)

In [55]:
df_products.head()

  product_id                   product_name category_id launch_date  price
0        P-1        MacBook Pro (Touch Bar)       CAT-1  2016-10-01   1499
1        P-2                        AirPods       CAT-2  2016-12-01    159
2        P-3           iPad Pro (10.5-inch)       CAT-3  2017-06-01    649
3        P-4  iPad Pro (12.9-inch, 2nd Gen)       CAT-3  2017-06-01    799
4        P-5    MacBook Pro (13-inch, 2017)       CAT-1  2017-06-01   1299

In [11]:
df_category.isna().sum()

category_id      0
category_name    0
dtype: int64

In [13]:
df_category.duplicated().sum()

0

In [65]:
data = pd.read_csv(r"D:\New folder\sales.csv")
df_sales=pd.DataFrame(data)

In [57]:
df_sales.head()

      sale_id   sale_date store_id product_id  quantity
0  OID-358365  16-09-2021    ST-33       P-44         1
1  OID-358510  28-01-2022    ST-33       P-44         1
2  OID-358525  26-11-2021    ST-33       P-44         1
3  OID-358591  15-09-2021    ST-33       P-44         1
4  OID-358601    7/2/2022    ST-33       P-44         1

In [23]:
df_sales.isna().sum()

sale_id       0
sale_date     0
store_id      0
product_id    0
quantity      0
dtype: int64

In [25]:
df_sales.duplicated().sum()

0

In [67]:
data = pd.read_csv(r"D:\New folder\stores.csv")
df_stores=pd.DataFrame(data)

In [59]:
df_stores.head()

  Store_ID             Store_Name           City        Country
0     ST-1     Apple Fifth Avenue       New York  United States
1     ST-2     Apple Union Square  San Francisco  United States
2     ST-3  Apple Michigan Avenue        Chicago  United States
3     ST-4        Apple The Grove    Los Angeles  United States
4     ST-5             Apple SoHo       New York  United States

In [31]:
df_stores.isna().sum()

Store_ID      0
Store_Name    0
City          0
Country       0
dtype: int64

In [33]:
df_stores.duplicated().sum()

0

In [35]:
data = pd.read_csv(r"D:\New folder\warranty.csv")
df_warranty=pd.DataFrame(data)

  claim_id  claim_date     sale_id  repair_status
0   CL-285  2020-01-17  OID-363381  Free Replaced
1   CL-290  2020-01-19  OID-363359  Free Replaced
2   CL-291  2020-01-19  OID-363371  Free Replaced
3   CL-299  2020-01-21  OID-363397  Free Replaced
4   CL-308  2020-01-23  OID-363395  Free Replaced

In [61]:
df_warranty.head()

  claim_id  claim_date     sale_id  repair_status
0   CL-285  2020-01-17  OID-363381  Free Replaced
1   CL-290  2020-01-19  OID-363359  Free Replaced
2   CL-291  2020-01-19  OID-363371  Free Replaced
3   CL-299  2020-01-21  OID-363397  Free Replaced
4   CL-308  2020-01-23  OID-363395  Free Replaced

In [37]:
df_warranty.isna().sum()

claim_id         0
claim_date       0
sale_id          0
repair_status    0
dtype: int64

In [39]:
df_warranty.duplicated().sum()

0